# Python有很多内置函数，可以直接调用
# Python内置函数一共69个
# https://docs.python.org/zh-cn/3/library/functions.html
# 例如：
# 求绝对值
abs(-20); 	# 20
abs(20);	# 20
# 调用函数的时候，如果传入的参数数量不对，会报TypeError的错误，并且会告诉你abs()有且仅有一个参数
# 如果传入的参数数量是对的，但参数类型不能被函数所接受，也会报TypeError的错误，并且给出错误信息：str是错误的参数类型：

# max()函数可以接受任意多个参数，并返回最大的数
max(1, 3);
max(1, 3, 5, 7);

# 数据类型转换
# Python内置的常用函数还包括数据类型转换函数，比如int()函数可以吧其它数据类型转换为整数
int('123');		# 123
float('12.34');	# 12.34
str(123);	# '123'
bool(1);	# True
bool(''); 	# False

# 函数名其实就是指向一个函数对象的引用，完全可以把函数名赋给一个变量，相当于给这个函数起了一个‘别名’
e = abs;
e(-1); # 1

# 练习：
# 使用Python内置的hex()函数把一个整数转换成十六进制表示的字符串
n1 = 255;
n2 = 1000;
print('n1转换为十六进制的字符串是：%s'%hex(n1))
print('n2转换为十六进制的字符串是：%s'%hex(n2))

